app/views/languages/show.html.haml

SELECT "projects".* FROM "projects" INNER JOIN "participation" ON "projects"."id" = "participation"."project_id" WHERE "participation"."language_id" = $1  [["language_id", 5]]
---
  %h2 Projects
  - @language.projects.each do |project|