app/controllers/languages_controller.rb

  def show
    #@project = Project.find(params[:id])
    #@language = @project.languages.build
    #@project = Project.find(params[:project_id])
    @language = Language.find(params[:id])
---
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT 1  [["id", 1]]

  def index
    @languages = Language.all
---
SELECT "languages".* FROM "languages"