app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def new
    @developer = Developer.find(params[:developer_id])
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @developer = Developer.find(params[:developer_id])
    @project = @developer.projects.build(project_params)

    if @project.save
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "projects" ("name", "description", "developer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "SuperProject"], ["description", "This is my new super duper project"], ["developer_id", 2], ["created_at", "2016-01-03 08:21:38.382100"], ["updated_at", "2016-01-03 08:21:38.382100"]]

  def upvote
    #@developer = Developer.find(params[:developer_id])
    #@project = @developer.projects.build(project_params)
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]

  def unvote
    #@developer = Developer.find(params[:developer_id])
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]